{"location":{"latitude":0.0,"longitude":0.0},"name":"Masarykova N°30","operator":{"name":"PRAGUE STAY, SVOBODA AND WILLIAMS s.r.o.","address":{"houseNumber":"0","road":"","city":"Praha","county":null,"stateDistrict":null,"state":null,"postCode":"118 00","countryCode":"CZ"},"contact":{"email":"info@prague-stay.com","phone":"+420 222 311 084","url":null},"vatin":"CZ27588785"},"description":"Attractive Residence\r\nThis gorgeously renovated, air-conditioned&nbsp;Historicist&nbsp;corner&nbsp;building, just seconds from the&nbsp;Cathedral of St. Peter and St. Paul and the Vegetable Market square,&nbsp;is home to the Masarykova N&deg;30 Boutique Residence (with only 12 apartments), complete with&nbsp;free Wi-Fi Internet, a brand new glass lift, serviced offices and much more. The building&rsquo;s original architectural elements have been meticulously renovated including intricate decor on the exterior facade, the interior&rsquo;s spiral staircase and interesting wall niches. The building houses 12 serviced apartments (named after fascinating minerals and stones: Amethyst, Citrine, Diamond, Graphite, Heliodor, Jasper, Moonstone, Neptunite, Onyx, Rhodonite, Sapphirine, Tiger&rsquo;s Eye), all providing fantastic accommodation in the center of historic Brno. The next door building, a lovely architectural affair with attractive bay windows is part of the residence as well (the buildings are connected inside on the upper floors). In the immediate area you can find all services including pharmacies, shops, cafes &amp; restaurants, nightlife and more. There is a tram stop just seconds from the building.&nbsp;Parking is available on Novobranská Street (approx. 4 minutes on foot).\r\nGateway to Historic Brno\r\nThe representative building, situated on the main street with a tram line, close to&nbsp;Brno hlavní nádraží (the main train station) acts as a gorgeous gateway to the historic core of Brno. The building is across from / close to several interesting buildings (one of which has three colorful, decorative roosters perched above, another being St. Mary Magdalene Church). The surrounding area is home to the Cathedral of St. Peter and St. Paul, perched atop Petrov Hill as well as the Capuchin Crypt (home to mummies of the Capuchin monks) and the bustling Vegetable Market square with a daily farmer&rsquo;s market. It is of interest to note that you can visit The Labyrinth Under the Vegetable Market &ndash; a system of underground corridors / cellars that date back to the Middle Ages. Brno, with the second largest historic preservation zone in the Czech Republic, is also home to Špilberk Castle, one of the main sights and the Brno Ossuary, the second largest in Europe after the Paris Catacombs. The city is known for its architecture and it does not disappoint &ndash; from the Old World historic buildings in the center to the world famous Villa Tugendhat, Brno is simply awe-inspiring.\r\nApartment Amenities\r\nApartment amenities include free Wi-Fi Internet, air-conditioning, alarm system, washer &amp; dryer, satellite TV with Internet access and more. The price includes weekly cleaning, full linens and towels. The apartments have parquet flooring, renovated original casement windows, bathrooms with tile, glass mosaics or marble, and stylish, comfortable décor and furnishings.\r\nWe offer airport transfers from Václav Havel Airport Prague to the center of Brno and back.","roomTypes":[{"name":"Amethyst Apartment","description":"Serviced Apartment in Brno\r\nSituated just a few steps from the Cathedral of St. Peter and St. Paul and the Vegetable Market square, the air-conditioned Amethyst Apartment with free Wi-fi Internet is housed in the renovated Masarykova N&deg;30 residence that is complete with a lift, serviced offices and more. The 3rd floor Amethyst Apartment offers stylish accommodation with attractive decorations and comfortable furnishings, parquet flooring and renovated original casement windows. The apartment has a living room with a fully kitted kitchen line, dining table and relaxation area (TV, sofa bed), a bedroom, a full bathroom (bathtub, toilet, sink, interestingly textured wall tile), and an entrance hall. The windows face pretty buildings across the street from a similar era.\r\nBrno City Center\r\nThe apartment is in a representative&nbsp;Historicist building that is just moments from the main train station and is set on a main street with a tram line (with a tram stop seconds away) in the historic core of Brno. Next to / across from the residence there are several interesting buildings (a residential building with three decorative roosters perched atop the roof, the St. Mary Magdalene Church, etc.). Right by the building you can find the evocative Capuchin Crypt, while the Cathedral of St. Peter and St. Paul is a short walk away as is the lively Vegetable Market Square (complete with a daily market). Underneath the Vegetable Market lurks an atmospheric underground labyrinth that dates back to the Middle Ages. Further afield you can pay a visit to the UNESCO-protected, world famous Villa Tugendhat, a favorite among locals and tourists. It is important to note that a visit to the villa should be booked months in advance (convenient online booking available) as it is a very popular sight. Pharmacies, cafes and restaurants, nightlife, banks, stores, etc., all in the immediate vicinity.\r\nAmenities \r\nAmenities in the Amethyst Apartment include free Wi-Fi Internet, air-conditioning, alarm system, washer &amp; dryer, satellite TV with Internet access, weekly cleaning, full linen and towels. The price is for 3 persons; extra person EUR 30 per night.&nbsp;\r\nBuilding information: Masarykova N&deg;30\r\nParking: Garage on Novobranská Street, 4 minutes on foot\r\nWe offer airport transfers to Brno from Prague and back.","totalQuantity":1,"occupancy":{"min":1,"max":4},"amenities":null,"images":["https://siestacloudlive.blob.core.windows.net/default/83b9381d-8139-41d5-8cf7-582a56ed127a.jpg","https://siestacloudlive.blob.core.windows.net/default/808a63f7-3c39-421a-adaf-e4a80eaf079f.jpg","https://siestacloudlive.blob.core.windows.net/default/c22fc03b-af47-4d23-94f6-aba1c0949db1.jpg","https://siestacloudlive.blob.core.windows.net/default/e8acde62-83a8-4c02-b7dd-a43d171041c8.jpg","https://siestacloudlive.blob.core.windows.net/default/792fa83f-230c-4661-8ce4-d3225ad1672c.jpg","https://siestacloudlive.blob.core.windows.net/default/0898e712-7e57-4fce-b377-24713f62f673.jpg","https://siestacloudlive.blob.core.windows.net/default/a54652e9-2390-419d-94c6-6e2aa0e4a3e2.jpg","https://siestacloudlive.blob.core.windows.net/default/ae3671ed-e8cb-4146-bc82-0f4a7fdfb414.jpg","https://siestacloudlive.blob.core.windows.net/default/02d8e9f5-267d-4b71-ac4b-d7d1961a34ea.jpg","https://siestacloudlive.blob.core.windows.net/default/25acacaa-f6d0-48a8-9a87-3d3f557d0130.jpg","https://siestacloudlive.blob.core.windows.net/default/ce908e99-84eb-4b58-bede-984bd0402509.jpg"],"properties":null,"id":"48","updatedAt":"2019-11-04T20:37:15.0713923Z"},{"name":"Citrine Apartment","description":"Fine Living in Brno \r\nSituated just a few steps from the main Cathedral of St. Peter and St. Paul and&nbsp;the Vegetable Market square&nbsp;is the air-conditioned Citrine Apartment with free Wi-fi Internet. Housed in the Masarykova N&deg;30 residence that is complete with a&nbsp;lift, serviced offices and more, this makes for high standard living in Brno. The 3rd floor apartment has a corner living room with a fully kitted kitchen line, dining table and relaxation area (TV, sofa bed), a bedroom, a bathroom (shower, toilet, sink, mosaic tile), and an entrance hall. The living room boasts windows on two walls and an enclosed balcony &ndash; the light in this room is quite fantastic. The windows provide views of pretty buildings across the street, all from a similar era, and the train station. Guests are sure to enjoy the apartment&rsquo;s stylish interior with interesting décor, quality furnishings, parquet flooring and renovated original casement windows.\r\nHistoric Center in Brno\r\nThe Citrine Apartment is housed in the Masarykova N&deg;30 residence, a pretty&nbsp;Historicist gem that has undergone a meticulous renovation making it superb for holiday living. The building is set on the main street, with a tram line (there is a tram stop seconds from the building), in the historic center of Brno just moments from the main train station. In the immediate vicinity of the building are some very interesting buildings, e.g. a residential building with three roasters proudly perched atop its roof and the Church of St. Mary Magdalene. Just a stone&rsquo;s throw from the residence you can find the Capuchin Crypt, the main cathedral and the Vegetable Market Square (boasting a daily market). Further afield is the UNESCO-protected Villa Tugendhat, a favorite among locals and tourists. Pharmacies, cafes and restaurants, nightlife, banks, stores, etc., all in the immediate vicinity.\r\nAmenities \r\nAmenities in the Citrine Apartment include free Wi-Fi Internet, air-conditioning, alarm system, washer &amp; dryer, satellite TV with Internet access and more. The price includes weekly cleaning, full linens and towels.&nbsp;The price is for 3 persons; extra person EUR 30 per night.\r\nBuilding information: Masarykova N&deg;30\r\nParking: Garage on Novobranská Street, 4 minutes on foot\r\nWe offer airport transfers to Brno from Prague and back.","totalQuantity":1,"occupancy":{"min":1,"max":4},"amenities":null,"images":["https://siestacloudlive.blob.core.windows.net/default/ad4808d9-0e57-43fc-a918-db04c3704cb0.jpg","https://siestacloudlive.blob.core.windows.net/default/508f5ac7-f873-42da-ba6f-eb490a9e1ec3.jpg","https://siestacloudlive.blob.core.windows.net/default/559ebd3f-8a90-40c1-b929-addf31fd9cb6.jpg","https://siestacloudlive.blob.core.windows.net/default/1fd0283e-a6e9-4471-872f-af571e8940bf.jpg","https://siestacloudlive.blob.core.windows.net/default/6a299256-cdcd-4b6f-aec3-5a9462c1ec68.jpg","https://siestacloudlive.blob.core.windows.net/default/5375dec6-57aa-41b8-bb6a-c5bb051feb33.jpg","https://siestacloudlive.blob.core.windows.net/default/a55c6271-94ee-40bb-bbdf-637fa474b932.jpg","https://siestacloudlive.blob.core.windows.net/default/52c14b51-8364-470e-83a3-05b2c7f53ced.jpg","https://siestacloudlive.blob.core.windows.net/default/45085600-6f01-45ba-beaf-da3b31718dae.jpg","https://siestacloudlive.blob.core.windows.net/default/9cd81aab-9dea-4492-80d6-0836509a00bb.jpg"],"properties":null,"id":"49","updatedAt":"2019-11-04T20:37:15.0724589Z"},{"name":"Diamond Apartment","description":"Live in a Tower! \r\nSituated just a few steps from the main Cathedral of St. Peter and St. Paul and the Vegetable Market square is the air-conditioned two-bedroom two-bathroom Diamond Apartment with free Wi-Fi Internet. The apartment is housed in the Masarykova N&deg;30 residence that is complete with a lift, serviced offices, and more. This impressive 6th floor apartment boasts a tower living room that features a sleeping loft, a living area with a sofa bed &amp; TV, a fully fitted kitchen, and a dining area; two bedrooms, a full bathroom (bathtub, toilet, sink), another bathroom (shower, 2nd toilet, sink), and a foyer. The living room has exposed ceiling beams, skylights, and built-in library shelves in the stairs leading to the sleeping loft. Guests are sure to enjoy the apartment&rsquo;s stylish interior with interesting décor, quality furnishings, and parquet flooring.\r\nBrno City Living \r\nThe Diamond Apartment is housed in the Masarykova N&deg;30 residence (a beautifully renovated&nbsp;Historicist corner building) on the main street &ndash; with a tram line (there is a tram stop seconds from the building) - in the historic center of Brno. Located seconds away you can find the main train station, the Capuchin Crypt, the main cathedral and Vegetable Market Square (boasting a daily market &amp; an underground labyrinth that dates back to the Middle Ages). Further afield is the UNESCO-protected Villa Tugendhat, a favorite among locals and tourists. Pharmacies, banks, stores, etc., all in the immediate vicinity. Brno is known for its culinary and nightlife scene &ndash; take advantage of this exciting city!\r\nAmenities \r\nAmenities in the Diamond Apartment include free Wi-Fi Internet, air conditioning,&nbsp;an alarm system, a washer &amp; dryer, satellite TV with Internet access, and more. The price includes weekly cleaning, full linen and towels. The price is for 5 persons; each extra person is EUR 15 per night.\r\n&nbsp;\r\nBuilding information: Masarykova N&deg;30\r\nParking: Garage on Novobranská Street, 4 minutes on foot\r\nWe offer airport transfers to Brno from Prague and back.","totalQuantity":1,"occupancy":{"min":1,"max":7},"amenities":null,"images":["https://siestacloudlive.blob.core.windows.net/default/baf3ee39-656c-44e8-a052-ebecd8654cca.jpg","https://siestacloudlive.blob.core.windows.net/default/deb6828c-96d4-4dce-86a8-f097c6794bc4.jpg","https://siestacloudlive.blob.core.windows.net/default/a02f7870-ffd2-4e36-81b4-774857f9f150.jpg","https://siestacloudlive.blob.core.windows.net/default/ddde0fec-ce32-48d6-bd31-f3695ff07700.jpg","https://siestacloudlive.blob.core.windows.net/default/3ffca90e-fa11-463f-afa1-ce91e74c4de9.jpg","https://siestacloudlive.blob.core.windows.net/default/e780fbb1-be32-4330-970e-4971ab7c8408.jpg","https://siestacloudlive.blob.core.windows.net/default/027760c5-e1c7-4ca6-80da-bc5b8d07baa7.jpg","https://siestacloudlive.blob.core.windows.net/default/0fa55cf6-314e-4681-ad16-b6b6007678e5.jpg","https://siestacloudlive.blob.core.windows.net/default/39c25cbb-686f-493a-ad69-78f239245a5c.jpg","https://siestacloudlive.blob.core.windows.net/default/acbfad48-ff3c-44d6-b492-c0c715f02a83.jpg","https://siestacloudlive.blob.core.windows.net/default/240c5203-0931-4bc6-b3eb-561317508156.jpg","https://siestacloudlive.blob.core.windows.net/default/e0356678-db41-43b4-8cfd-7b67f87e4173.jpg","https://siestacloudlive.blob.core.windows.net/default/807aa541-fa66-49a9-82e8-38be014d06c2.jpg","https://siestacloudlive.blob.core.windows.net/default/d6a5f57e-2f69-4270-9629-2faca74ac5a0.jpg","https://siestacloudlive.blob.core.windows.net/default/e3ca2c0f-1791-4a58-bc25-c08841c5995f.jpg","https://siestacloudlive.blob.core.windows.net/default/c3e25235-d574-4226-980b-8459a97832e6.jpg","https://siestacloudlive.blob.core.windows.net/default/e530e8db-cad2-4637-8c30-bdcc095fddd3.jpg"],"properties":null,"id":"50","updatedAt":"2019-11-04T20:37:15.074243Z"},{"name":"Graphite Apartment","description":"Serviced Holiday Apartment in Brno\u2028\r\nSituated just a few steps from the main&nbsp;Cathedral of St. Peter and St. Paul and the&nbsp;Vegetable Market square is the&nbsp;air-conditioned&nbsp;Graphite Apartment with&nbsp;free Wi-fi Internet. Housed in the Masarykova N&deg;30 Historicist&nbsp;residence that is complete with a lift, serviced offices and more, this holiday apartment makes for high standard living in Brno. The 4th floor flat has a&nbsp;corner living room&nbsp;with a fully kitted kitchen line, dining table and relaxation area (TV, sofa bed), a bedroom, a bathroom (shower, toilet, sink), and an entrance hall. The living room has windows on two walls and an enclosed balcony&nbsp;&ndash; providing lovely natural light. The windows offer views of pretty buildings across the street, all from a similar era, and the train station. Guests of the Graphite will most definitely enjoy the stylish interior with high quality décor, furnishings, parquet flooring and renovated original casement windows.\r\nBrno City Center Living\r\nThe Graphite Apartment is set in the Masarykova N&deg;30 residence, a gorgeous corner building that has undergone a meticulous renovation. The building is set on the main street, with a tram line (there is a tram stop seconds from the building), in the historic core of Brno just moments from the main train station. The area is home to interesting buildings which can be seen from the living room, for example &ndash; a lovely residential building with three roasters proudly perched atop its roof. Just a stone&rsquo;s throw from the residence you can find the Capuchin Crypt, the main cathedral and the Vegetable Market square (boasting a daily market). History lovers take note &ndash; there is an extensive labyrinth underneath the market from the Middle Ages that can be toured. Should you wish to see more modern attractions, the beloved Villa Tugendhat is easily reachable. Pharmacies, banks, stores, etc., are all in the immediate vicinity. Brno is a city that is becoming more and more recognized for its culinary and nightlife scene. Check out some Brno restaurants and bars while in town!\r\nAmenities\r\nAmenities in the Graphite Apartment include&nbsp;free Wi-Fi Internet, air-conditioning,&nbsp;alarm system, washer &amp; dryer, satellite TV with Internet access and more.&nbsp;The price includes weekly cleaning, full linens and towels.&nbsp;The price is for 3 persons; extra person EUR 30 per night.\r\nBuilding information: Masarykova N&deg;30\r\nParking: Garage on Novobranská Street, 4 minutes on foot\r\nWe offer airport transfers to Brno from Prague and back.","totalQuantity":1,"occupancy":{"min":1,"max":4},"amenities":null,"images":["https://siestacloudlive.blob.core.windows.net/default/cf08f774-f796-48ae-8985-24291af72d56.jpg","https://siestacloudlive.blob.core.windows.net/default/b5ea068b-a3f6-48e0-85d0-bdd9c3273db4.jpg","https://siestacloudlive.blob.core.windows.net/default/6937a7f8-710d-4bf8-acc4-43a1cf4c9e9b.jpg","https://siestacloudlive.blob.core.windows.net/default/274ed847-eee6-4893-bb4b-63f83eda1141.jpg","https://siestacloudlive.blob.core.windows.net/default/4d7f8d67-8d4e-4498-95a9-54fedca76be5.jpg","https://siestacloudlive.blob.core.windows.net/default/21da5858-13be-4122-825d-0c44331cb4fb.jpg","https://siestacloudlive.blob.core.windows.net/default/03c04d67-266c-47b0-8bac-47e5616025fa.jpg","https://siestacloudlive.blob.core.windows.net/default/3d488003-7dd1-4c19-8e45-cef1aa361baf.jpg","https://siestacloudlive.blob.core.windows.net/default/48da6518-fbc1-426f-86ad-98ff748a289f.jpg"],"properties":null,"id":"51","updatedAt":"2019-11-04T20:37:15.0812722Z"},{"name":"Jasper Apartment","description":"Stylish Serviced Apartment in Brno\r\nSituated just a few steps from the Cathedral of St. Peter and St. Paul and the Vegetable Market square, the air-conditioned Jasper Apartment with free Wi-fi Internet is housed in the renovated Masarykova N&deg;30 residence (in a beautiful&nbsp;Historicist corner building) that is complete with a lift, serviced offices and more. The 4th floor Jasper Apartment offers a living room that is complete with a fully fitted kitchen line and dining area alongside a relaxation / sitting area (w/ TV, sofa bed). There is as well a cozy bedroom with a comfortable bed, a full bathroom (bathtub, toilet, sink) and an entrance foyer. The apartment boasts parquet flooring, renovated original casement windows. attractive wall tiles in the bathroom, stylish decorations and high standard furnishings. The windows face pretty buildings across the street from a similar era.\r\nStaying in Brno\r\nHoused in a representative building that is just moments away from the main train station and is set on a main street with a tram line (with a stop seconds away) in the historic core of Brno, the location of the Jasper Apartment is convenient indeed. Close to the residence there are several interesting buildings (just across the street you can find a residential building with three large roosters overlooking the city from its roof and the St. Mary Magdalene Church). Right by the building you can find the evocative Capuchin Crypt, while the Cathedral of St. Peter and St. Paul is a short walk away as is the lively Vegetable Market square (complete with a daily market). History lovers can have a wander underneath the Vegetable Market in an atmospheric underground labyrinth that dates back to the Middle Ages. Further afield you can pay a visit to the UNESCO-protected Villa Tugendhat, a favorite among locals and tourists. Pharmacies, cafes and restaurants, bars, nightlife, banks, stores, etc. - all can be found in the immediate vicinity.\r\nAmenities \r\nAmenities in the Jasper Apartment include free Wi-Fi Internet, air-conditioning, alarm system, washer &amp; dryer, satellite TV with Internet access and more. The price includes weekly cleaning, full linen and towels. The price is for 3 persons; extra person EUR 30 per night.&nbsp;\r\nBuilding information: Masarykova N&deg;30\r\nParking: Garage on Novobranská Street, 4 minutes on foot\r\nWe offer airport transfers to Brno from Prague and back.","totalQuantity":1,"occupancy":{"min":1,"max":4},"amenities":null,"images":["https://siestacloudlive.blob.core.windows.net/default/c11642d4-ffc6-4ab0-8b9e-3aac90f66a2f.jpg","https://siestacloudlive.blob.core.windows.net/default/9b6c5e8b-4b15-45e7-81d1-ddd5eee98843.jpg","https://siestacloudlive.blob.core.windows.net/default/fa47060b-8aa3-432d-8ed3-b80d3b4d76bf.jpg","https://siestacloudlive.blob.core.windows.net/default/49f20160-50ac-46ae-98af-7a0ec342ae0c.jpg","https://siestacloudlive.blob.core.windows.net/default/bde3e4e7-a875-450a-87a7-7742495efc85.jpg","https://siestacloudlive.blob.core.windows.net/default/c43bc131-9a44-4697-b577-7d549780603c.jpg","https://siestacloudlive.blob.core.windows.net/default/7c3ed494-08c9-4eac-9379-01b407fc131a.jpg","https://siestacloudlive.blob.core.windows.net/default/16c565d5-c375-4036-b780-ad8a2f2ef618.jpg","https://siestacloudlive.blob.core.windows.net/default/a70d9100-cf30-45e7-869c-03ee2ccdadb6.jpg","https://siestacloudlive.blob.core.windows.net/default/f25cbd1e-db4e-42b4-acf7-e906a4548d4f.jpg"],"properties":null,"id":"52","updatedAt":"2019-11-04T20:37:15.0822641Z"},{"name":"Moonstone Apartment","description":"Attractive Brno Holiday Apartment\r\nSituated just a few steps from the Cathedral of St. Peter and St. Paul and the Vegetable Market square is the air-conditioned Moonstone Apartment with free Wi-fi Internet. The Brno holiday apartment is in the Masarykova N&deg;30 residence, which is housed in a renovated&nbsp;Historicist corner building, and is complete with&nbsp;a&nbsp;lift, serviced offices and more. The 4th floor Moonstone Apartment offers stylish accommodation in Brno &ndash; perfect for a short or even a medium stay in the capital of Moravia. The apartment features a living room with a fully fitted kitchen line and dining area and a relaxation / sitting area (w/ TV, sofa bed). There is as well a separate bedroom, a full bathroom (bathtub, toilet, sink) and an entrance foyer. The interior includes parquet flooring, renovated original casement windows, attractive wall tiles in the bathroom, cool decorations and high standard furnishings. The windows provide views of pretty buildings from a similar era and the main street.\r\nHistoric Brno Core\r\nThe building is just a hop, skip and a jump away from the main train station (perfect for travelers) and is set on a main street with a tram line (there is a tram stop seconds away). Situated in the heart of historic Brno, the building is just seconds from the evocative Capuchin Crypt (complete with dozens of mummified monks), the Cathedral of St. Peter and St. Paul, and the lively Vegetable Market square (complete with a daily market). Lovers of architecture can visit the world renowned, UNESCO-protected Villa Tugendhat, a favorite among locals and tourists &ndash; just don&rsquo;t forget to book your visit online beforehand (we recommend booking months in advance). Pharmacies, banks, stores, etc. - all can be found in the immediate vicinity. Brno is known for its culinary and nightlife scene &ndash; have a look at our recommended Brno restaurants and bars.\r\nAmenities \r\nAmenities in the Moonstone Apartment include free Wi-Fi Internet, air-conditioning, alarm system, washer &amp; dryer, satellite TV with Internet access and more. The price includes weekly cleaning, full linen and towels. The price is for 3 persons; extra person EUR 30 per night.&nbsp;\r\nBuilding information: Masarykova N&deg;30\r\nParking: Garage on Novobranská Street, 4 minutes on foot\r\nWe offer airport transfers to Brno from Prague and back.","totalQuantity":1,"occupancy":{"min":1,"max":4},"amenities":null,"images":["https://siestacloudlive.blob.core.windows.net/default/eee8b95b-366d-433a-8b62-b668205716f5.jpg","https://siestacloudlive.blob.core.windows.net/default/4b0cd8a9-51dd-4527-baa9-66553288c632.jpg","https://siestacloudlive.blob.core.windows.net/default/084e0430-410b-49e9-80ad-e7638c8b4af4.jpg","https://siestacloudlive.blob.core.windows.net/default/6efc6c4f-d626-4361-a8f5-59b3a0e7712d.jpg","https://siestacloudlive.blob.core.windows.net/default/b71502cb-0656-478d-b5f7-ac879a2e0311.jpg","https://siestacloudlive.blob.core.windows.net/default/6ecfc7ad-0a47-4e04-a441-5271dfaa7304.jpg","https://siestacloudlive.blob.core.windows.net/default/73c10a80-9db7-4fc6-a5a9-45dc4c18bb82.jpg","https://siestacloudlive.blob.core.windows.net/default/af4fd43e-21f0-4ead-9080-18d663d3858c.jpeg","https://siestacloudlive.blob.core.windows.net/default/5a987ae9-ff1e-4e7a-bfe0-363d28084451.jpg","https://siestacloudlive.blob.core.windows.net/default/38194f63-9af0-4057-832a-79b15fb2fc52.jpg"],"properties":null,"id":"53","updatedAt":"2019-11-04T20:37:15.0836772Z"},{"name":"Neptunite Apartment ","description":"Attractive Living in Brno \r\nSituated just a few steps from the main&nbsp;Cathedral of St. Peter and St. Paul and the&nbsp;Vegetable Market square is the&nbsp;air-conditioned Neptunite Apartment with free Wi-fi Internet. The apartment is housed in the Masarykova N&deg;30 residence that is complete&nbsp;a lift, serviced offices, etc. Neptunite is situated in the building next door &ndash; connected to N&deg;30 on the 5th floor and part of the residence. The 6th floor apartment offers attractive, high standard temporary accommodation in the heart of Brno. The apartment features a large living room that is complete with a fully fitted kitchen area with a breakfast bar and table and a sitting area (TV, sofa bed). There is a bedroom just off the main room with its own walk-in closet. Both the living room and the bedroom have floor-to-ceiling windows (with built-in window seats), providing lovely natural light.&nbsp;Furthermore, the apartment has a large full bathroom (bathtub, shower, toilet, sink), an entry hall and adequate storage space. Guests of the residence are sure to love the apartment&rsquo;s stylish interior décor, comfortable furnishings, parquet flooring and high quality bathroom tiles.\r\nBrno City Center \r\nThe corner building that is home to the residence is located on the main street (with a tram line &ndash; there is a tram stop seconds from the building) right in the historic core of Brno just seconds from the main train station. Guests of the building will be charmed by the atmospheric Capuchin Crypt, the main cathedral and the Vegetable Market square (complete with a daily vegetable and fruit market and an underground labyrinth from the Middle Ages &ndash; which you can excitedly tour) &ndash; all of which are just a few moments away. The culinary and nightlife scene in Brno is flourishing &ndash; have a look at our recommended Brno bars and restaurants in Brno for our top picks. Pharmacies, banks and stores can all be found directly in the area of the residence. Lovers of modern architecture should visit Villa Tugendhat, a UNESCO-protected site located further afield &ndash; be aware that you must book a tour months in advance (possible online).\r\nAmenities\r\nAmenities in the Neptunite Apartment include&nbsp;free Wi-Fi Internet, air-conditioning,&nbsp;alarm system, washer &amp; dryer, satellite TV with Internet access and more.&nbsp;The price includes weekly cleaning, full linens and towels.&nbsp;The price is for 3 persons; extra person EUR 30 per night.\r\nBuilding information: Masarykova N&deg;30\r\nParking: Garage on Josefská Street, 4 minutes on foot","totalQuantity":1,"occupancy":{"min":1,"max":4},"amenities":null,"images":["https://siestacloudlive.blob.core.windows.net/default/b7d7bb4b-e580-47f1-a595-809e14d40933.jpg","https://siestacloudlive.blob.core.windows.net/default/f3e15bbb-5ac6-4879-8225-c5238633c4d1.jpg","https://siestacloudlive.blob.core.windows.net/default/063ec22c-9d4f-4fad-9283-ced8f6b565a9.jpg","https://siestacloudlive.blob.core.windows.net/default/45bcca9e-9bc6-4057-a1ad-7e5d44e02bed.jpg","https://siestacloudlive.blob.core.windows.net/default/980929de-3910-441b-a383-a96159cf5898.jpg","https://siestacloudlive.blob.core.windows.net/default/fba035b6-8038-4969-9d17-2fc2d68d8ab0.jpg","https://siestacloudlive.blob.core.windows.net/default/3f948a6b-d86f-4019-b2ee-1f3586a1b144.jpg","https://siestacloudlive.blob.core.windows.net/default/f0ef9be1-a4bf-412c-b043-b3dba9d29da6.jpg","https://siestacloudlive.blob.core.windows.net/default/46d385be-b581-4c6a-a96a-d6482032291b.jpg","https://siestacloudlive.blob.core.windows.net/default/49753e2e-186f-4173-8c50-2995fd79d2d5.jpg"],"properties":null,"id":"54","updatedAt":"2019-11-04T20:37:15.0906144Z"},{"name":"Onyx Apartment","description":"Brno Holiday Apartment\r\nSituated just a few steps from the main&nbsp;Cathedral of St. Peter and St. Paul and the&nbsp;Vegetable Market square is the&nbsp;air-conditioned Onyx Apartment with free Wi-fi Internet. The apartment is housed in the Masarykova N&deg;30 residence that is complete with&nbsp;a lift, serviced offices, etc. The 6th floor apartment features a living room that is complete with a fully fitted kitchen area &amp; dining table and a sitting area (TV, sofa bed). There is a bedroom off the main hall, a bathroom (shower, sink), a WC (toilet, sink), and an entry hall. The apartment has atelier roof windows, marble tile in the bathrooms, stylish décor, parquet flooring and comfortable furnishings &ndash; making it all in all, a perfect place to stay in Brno.\r\nThe Core of Brno\r\nThe gorgeously renovated&nbsp;Historicist&nbsp;corner&nbsp;building that houses the residence is on a main street that has a tram line (there is a tram stop seconds from the building), directly in the historic core of Brno and conveniently just seconds from the main train station. The immediate area is simply magical &ndash; there is the atmospheric Capuchin Crypt, the impressive&nbsp;main cathedral and the bustling Vegetable Market square (complete with a daily vegetable and fruit market and an underground labyrinth from the Middle Ages) &ndash; all of which are merely seconds away. Should you wish to explore the culinary and nightlife scene in Brno, we&rsquo;ve got you covered &ndash; have a look at our recommended picks of Brno restaurants and the best bars in Brno. Located a bit out of the historic center is Villa Tugendhat, a UNESCO-protected architectural marvel. Pharmacies, banks and stores can all be found directly in the area of the residence.\r\nAmenities\r\nAmenities in the Onyx Apartment include&nbsp;free Wi-Fi Internet, air-conditioning,&nbsp;alarm system, washer &amp; dryer, satellite TV with Internet access and more.&nbsp;The price includes weekly cleaning, full linens and towels.&nbsp;The price is for 3 persons; extra person EUR 30 per night.\r\nBuilding information: Masarykova N&deg;30\r\nParking: Garage on Novobranská Street, 4 minutes on foot\r\nWe offer airport transfers to Brno from Prague and back.","totalQuantity":1,"occupancy":{"min":1,"max":4},"amenities":null,"images":["https://siestacloudlive.blob.core.windows.net/default/4d4a342b-cd96-4e7c-9bb7-b7777c82b78c.jpg","https://siestacloudlive.blob.core.windows.net/default/b62bdf98-e6be-4799-909b-ebcd2e2381b9.jpg","https://siestacloudlive.blob.core.windows.net/default/76211927-d588-41e8-8195-14aa807d6951.jpg","https://siestacloudlive.blob.core.windows.net/default/97587295-e807-472f-bb9a-16a351f9189a.jpg","https://siestacloudlive.blob.core.windows.net/default/5822bfde-6ec7-47bb-b406-7935c2da0438.jpg","https://siestacloudlive.blob.core.windows.net/default/c15fa5fd-948b-41c8-a646-4db4c112bf9e.jpg","https://siestacloudlive.blob.core.windows.net/default/df62cfe2-e168-4216-bcbb-99b6600dd2fa.jpg","https://siestacloudlive.blob.core.windows.net/default/683443c7-9aa2-4232-a3f3-32b6bbf89c3e.jpg"],"properties":null,"id":"55","updatedAt":"2019-11-04T20:37:15.0916Z"},{"name":"Rhodonite Apartment","description":"Brno Holiday Flat \r\nSituated just a few steps from the main&nbsp;Cathedral of St. Peter and St. Paul and the&nbsp;Vegetable Market square is the&nbsp;air-conditioned&nbsp;two-bedroom two-bathroom Rhodonite Apartment with&nbsp;free Wi-fi Internet. Housed in the Masarykova N&deg;30 Historicist residence that is complete with&nbsp;a lift, serviced offices and more, this holiday apartment makes for high standard living in Brno. The 5th floor apartment offers a living room with a fully kitted kitchen line, dining table and relaxation area (TV, sofa bed), two bedrooms, two bathrooms (one ensuite with bathtub, toilet, sink; other with shower, 2nd toilet, sink), and an entrance foyer. The windows offer views of pretty buildings across the street, all from a similar era (e.g. there is a lovely residential building across the street with three large, decorative roasters proudly perched atop its roof). Guests will most definitely enjoy the stylish, pretty interior design of the apartment including high quality décor, comfortable furnishings, parquet flooring, marble tiles in the bathrooms and renovated original casement windows.\r\nBrno City Center Living\r\nThe Rhodonite Apartment is set in the Masarykova N&deg;30 residence, a gorgeous corner building that has undergone a meticulous renovation. The building is set on the main street, with a tram line (there is a tram stop seconds from the building), in the historic core of Brno just moments from the main train station. Just a stone&rsquo;s throw from the residence you can find the Capuchin Crypt, the main cathedral and the Vegetable Market square (boasting a daily market). If you are feeling adventurous, there is an extensive labyrinth underneath the Vegetable Market square that dates back to the Middle Ages &ndash; spend an afternoon exploring it. If you wish to see more modern attractions, the beloved Villa Tugendhat (a UNESCO-protected architectural marvel) is easily reachable. Pharmacies, banks and stores can all be found in the immediate vicinity. Brno is becoming quite known for its culinary and nightlife scene &ndash; go ahead and paint the town red!\r\nAmenities\r\nAmenities in the Rhodonite Apartment include&nbsp;free Wi-Fi Internet, air-conditioning,&nbsp;alarm system, washer &amp; dryer, satellite TV with Internet access and more.&nbsp;The price includes weekly cleaning, full linens and towels.&nbsp;The price is for 5 persons; extra person EUR 30 per night.\r\nBuilding information: Masarykova N&deg;30\r\nParking: Garage on Novobranská Street, 4 minutes on foot\r\nWe offer airport transfers to Brno from Prague and back.","totalQuantity":1,"occupancy":{"min":1,"max":6},"amenities":null,"images":["https://siestacloudlive.blob.core.windows.net/default/7fb9ba93-e525-457d-a0a6-8d7389dc24c7.jpg","https://siestacloudlive.blob.core.windows.net/default/bcc80e15-783e-40ab-bba4-f23afe6afc20.jpg","https://siestacloudlive.blob.core.windows.net/default/11c764bd-ad3f-414d-b100-64994458e9de.jpg","https://siestacloudlive.blob.core.windows.net/default/47132ef1-8567-4f42-ad0c-19900fae24c3.jpg","https://siestacloudlive.blob.core.windows.net/default/2d227dfb-fffd-469d-829a-17e619224b87.jpg","https://siestacloudlive.blob.core.windows.net/default/4db06cf0-5cf1-4b79-add4-90b37d216776.jpg","https://siestacloudlive.blob.core.windows.net/default/38e151b2-ee1d-41eb-99d8-6cea919b5607.jpg","https://siestacloudlive.blob.core.windows.net/default/fc68a440-b467-41d7-8f4a-03bed3101c07.jpg","https://siestacloudlive.blob.core.windows.net/default/bdd34d1a-6219-46f9-97e3-61177ce92553.jpg","https://siestacloudlive.blob.core.windows.net/default/4053d1f6-75d6-40db-a368-1a7ad47f8729.jpg","https://siestacloudlive.blob.core.windows.net/default/faab5367-3a6a-4026-bd1d-55df35c60cf2.jpg"],"properties":null,"id":"56","updatedAt":"2019-11-04T20:37:15.092722Z"},{"name":"Sapphirine Apartment","description":"Vacation Apartment in Brno\r\nSituated just a few steps from the main&nbsp;Cathedral of St. Peter and St. Paul and the&nbsp;Vegetable Market square is the&nbsp;air-conditioned&nbsp;two-bedroom two-bathroom Sapphirine Apartment, boasting a balcony, free Wi-fi Internet and more. Housed in the Masarykova N&deg;30 residence that is complete with&nbsp;a&nbsp;lift, serviced offices, etc., this 5th floor flat offers attractive, high standard holiday accommodation. Guests are sure to love the corner living room, complete with a balcony (with a beautiful wrought iron railing) overlooking the main street &ndash; a perfect setting for your morning coffee. The living room has a fully kitted kitchen line, dining table and a relaxation area (TV, sofa bed). Two bedrooms (one w/ ensuite bathroom &ndash; bathtub, toilet, sink), another bathroom (shower, 2nd toilet, sink), and an entrance foyer complete the space. The windows overlook the main street below and offer views of pretty buildings &ndash; all from a similar era as the residence. It is interesting to note that one building has oversized decorative roosters perched atop its roof &ndash; there are great views of this whimsical oddity from the balcony. The interior has stylish décor, comfortable furnishings, parquet flooring, high quality tiles in the bathrooms and renovated original casement windows.\r\nThe Gateway of Brno\r\nThe Masarykova N&deg;30 residence is housed in a gorgeously renovated Historicist corner building that is set on the main street, which has a tram line (there is a tram stop seconds from the building), in the historic core of Brno just seconds from the main train station. Across from the building is the Capuchin Crypt, while the main cathedral and the Vegetable Market square (with a popular daily produce market) are just a few moments away. Lovers of history will get their kicks by exploring the labyrinth under the Vegetable Market square that dates back to the Middle Ages, while fans of modern architecture can get their design fix by visiting Villa Tugendhat (a UNESCO-protected site). Pharmacies, banks and stores can all be found in the immediate vicinity. The city is known for its culinary and nightlife scene &ndash; have a look at our top picks for Brno restaurants and bars in Brno.\r\nAmenities\r\nAmenities in the Sapphirine Apartment include&nbsp;free Wi-Fi Internet, air-conditioning,&nbsp;alarm system, washer &amp; dryer, satellite TV with Internet access and more.&nbsp;The price includes weekly cleaning, full linens and towels.&nbsp;The price is for 5 persons; extra person EUR 30 per night.\r\nBuilding information: Masarykova N&deg;30\r\nParking: Garage on Novobranská Street, 4 minutes on foot\r\nWe offer airport transfers to Brno from Prague and back.","totalQuantity":1,"occupancy":{"min":1,"max":6},"amenities":null,"images":["https://siestacloudlive.blob.core.windows.net/default/cfc3264b-037b-48e1-a346-473bb749daa1.jpg","https://siestacloudlive.blob.core.windows.net/default/4eb10523-80a2-4b27-9391-889dd2a71f59.jpg","https://siestacloudlive.blob.core.windows.net/default/725e643c-3807-43da-9908-23c5f0617302.jpeg","https://siestacloudlive.blob.core.windows.net/default/743e5552-ac21-4ca6-b6a1-6e784f368bcf.jpg","https://siestacloudlive.blob.core.windows.net/default/c9d8d991-995d-4982-81ae-5b76c76ba7b2.jpg","https://siestacloudlive.blob.core.windows.net/default/4a8deb4e-1bc6-427a-8a97-a45292632865.jpg","https://siestacloudlive.blob.core.windows.net/default/6a613f2a-a689-406c-a62a-d3a96d7f631b.jpg","https://siestacloudlive.blob.core.windows.net/default/731d5672-3b65-431f-b14f-e66ae94d4559.jpg","https://siestacloudlive.blob.core.windows.net/default/b7057076-c1d3-4604-95e9-6ab2e33f80c1.jpg","https://siestacloudlive.blob.core.windows.net/default/ce9b42ee-4467-44ef-921d-e8e3942f1639.jpg","https://siestacloudlive.blob.core.windows.net/default/1c487153-0a6e-41a7-9e4c-18664ea3680f.jpg","https://siestacloudlive.blob.core.windows.net/default/a7e70c8f-6ca7-4297-a31f-141bc0d65bea.jpg","https://siestacloudlive.blob.core.windows.net/default/7c0c3321-58ff-4ab1-98ac-335b5e53a715.jpg"],"properties":null,"id":"57","updatedAt":"2019-11-04T20:37:15.0939434Z"},{"name":"Tiger's Eye Apartment","description":"Attractive Living in Brno \r\nSituated just a few steps from the main&nbsp;Cathedral of St. Peter and St. Paul and the&nbsp;Vegetable Market square is the&nbsp;air-conditioned Tiger&rsquo;s Eye Apartment with free Wi-fi Internet. The apartment is housed in the Masarykova N&deg;30 residence that is complete with&nbsp;a lift, serviced offices, etc. Tiger&rsquo;s Eye is situated in the building next door &ndash; connected to N&deg;30 on the 5th floor and part of the residence. The 4th floor apartment offers high standard short term accommodation for up to three persons in an attractive space with a living room (with a fully fitted kitchen, dining table, sitting area &ndash; sofa bed, TV), a bedroom off the main room, a spacious full bathroom (bathtub, toilet, sink), adequate storage space, and an entrance hall. The apartment boasts gorgeous bay windows with built-in benches (perfect for watching street life below), fun décor, comfortable furnishings, parquet flooring and high quality tiles in the bathroom.\r\nHistoric Center of Brno\r\nLocated on the main street (with a tram line &ndash; there is a tram stop seconds from the building) in the historic core of Brno just seconds from the main train station, is the beautiful Masarykova N&deg;30 residence, set in a renovated Historicist corner building. In the immediate vicinity of the building you can find the atmospheric Capuchin Crypt, while the main cathedral and the Vegetable Market square (complete with a daily farmers market and an underground labyrinth from the Middle Ages) are just a few moments away. The Moravian city is known for its culinary and nightlife scene &ndash; why not explore the city properly and try some award-winning restaurants and/or Brno bars today, some of which have been mentioned in the New York Times. Pharmacies, banks and stores can all be found directly in the area of the residence. Lovers of modern architecture can get their design fix by visiting Villa Tugendhat, a UNESCO-protected site located further afield.\r\nAmenities\r\nAmenities in the Tiger&rsquo;s Eye Apartment include&nbsp;free Wi-Fi Internet, air-conditioning,&nbsp;alarm system, washer &amp; dryer, satellite TV with Internet access and more.&nbsp;The price includes weekly cleaning, full linens and towels.&nbsp;The price is for 2 persons; extra person EUR 30 per night.\r\nBuilding information: Masarykova N&deg;30\r\nParking: Garage on Novobranská Street, 4 minutes on foot\r\nWe offer airport transfers to Brno from Prague and back.","totalQuantity":1,"occupancy":{"min":1,"max":3},"amenities":null,"images":["https://siestacloudlive.blob.core.windows.net/default/e5ecf762-23dd-42de-845f-bdd0095ed1fe.jpg","https://siestacloudlive.blob.core.windows.net/default/e7e8596f-4253-4eeb-8762-da28e6cf5c8a.jpg","https://siestacloudlive.blob.core.windows.net/default/05d89a51-19c0-4704-9798-201d2e2716de.jpg","https://siestacloudlive.blob.core.windows.net/default/4e1d3d70-55f5-4974-b78c-b78da39b8da0.jpg","https://siestacloudlive.blob.core.windows.net/default/e6e0f142-2147-4eef-8e90-09c634e9b2c1.jpg","https://siestacloudlive.blob.core.windows.net/default/cb3e89a5-99b8-482d-a2aa-61d2fc6c1a4e.jpg","https://siestacloudlive.blob.core.windows.net/default/f795e281-9615-4cee-b8bc-bfcd5d056039.jpg","https://siestacloudlive.blob.core.windows.net/default/601d2f13-c032-416b-8ae5-ac7a4abac798.jpg","https://siestacloudlive.blob.core.windows.net/default/0d2cc93f-3ffd-4014-8d04-14585925a64b.jpg","https://siestacloudlive.blob.core.windows.net/default/fd74e9a6-e7ee-4910-b655-de27ab386af3.jpg","https://siestacloudlive.blob.core.windows.net/default/82eedd90-1fa9-4f98-9498-35fe532a7f9e.jpg","https://siestacloudlive.blob.core.windows.net/default/d923ad37-1008-4ad6-a84b-ce6a194fd6a3.jpg"],"properties":null,"id":"58","updatedAt":"2019-11-04T20:37:15.1008871Z"}],"contacts":{"general":{"email":"","phone":"","url":null}},"address":{"houseNumber":"0","road":"Kapucínské náměstí 15, Brno","city":"Brno","county":null,"stateDistrict":null,"state":null,"postCode":"60200","countryCode":"CZ"},"timezone":null,"currency":"CZK","spokenLanguages":null,"category":null,"images":["https://siestacloudlive.blob.core.windows.net/default/2d6a4163-8883-482f-bf83-bd767a9099b8.jpg","https://siestacloudlive.blob.core.windows.net/default/9e48eb78-08c5-438f-8a95-88e0c0f5855b.jpg","https://siestacloudlive.blob.core.windows.net/default/50f833e3-1f87-465d-9986-68577b7ada04.jpg","https://siestacloudlive.blob.core.windows.net/default/e9ca086b-babd-404d-a58b-acd14e054862.jpg","https://siestacloudlive.blob.core.windows.net/default/2c909d06-c484-431b-b880-d2542b94d5f6.jpg","https://siestacloudlive.blob.core.windows.net/default/a45fd72a-8823-48b7-b29d-8c6f20b1f4f7.jpg","https://siestacloudlive.blob.core.windows.net/default/5dedc77b-08f5-4eec-b197-4736df06d577.jpg","https://siestacloudlive.blob.core.windows.net/default/591394f4-af5b-4473-afd8-e09f5bed5bdb.jpg","https://siestacloudlive.blob.core.windows.net/default/4f29e337-1ac6-4cd8-891d-cc1f552210d0.jpg","https://siestacloudlive.blob.core.windows.net/default/2c24542c-b6ab-412b-976e-1537485e96b4.jpg","https://siestacloudlive.blob.core.windows.net/default/5bd4bf9a-8b3a-4e6e-a55d-e2bde59639fa.jpg","https://siestacloudlive.blob.core.windows.net/default/98af4858-451a-4acb-b1b5-60c94b000b38.jpg","https://siestacloudlive.blob.core.windows.net/default/b42ba5d4-add1-4f3b-9d83-ecc9f0dc7670.jpg"],"amenities":null,"updatedAt":"2019-11-04T20:37:15.1018182Z","defaultCancellationAmount":0.0,"cancellationPolicies":null}